# Join Statements - Lab

## Introduction

In this lab, you'll practice your knowledge of `JOIN` statements, using various types of joins and various methods for specifying the links between them.

## Objectives

You will be able to:
* Write SQL queries that make use of various types of joins
* Compare and contrast the various types of joins
* Discuss how primary and foreign keys are used in SQL
* Decide and perform whichever type of join is best for retrieving desired data

## CRM Schema

In almost all cases, rather than just working with a single table you will typically need data from multiple tables. 
Doing this requires the use of **joins** using shared columns from the two tables. 

In this lab, you'll use the same customer relationship management (CRM) database that you saw from the previous lesson.
<img src='images/Database-Schema.png' width="600">

## Connecting to the Database
Import the necessary packages and connect to the database `'data.sqlite'`.

In [1]:
# Your code here
import sqlite3
import pandas as pd

conn = sqlite3.connect('data.sqlite')
cur = conn.cursor()

## Display the names of all the employees in Boston 

Hint: join the employees and offices tables.

In [8]:
# Your code here
df = pd.DataFrame(cur.execute('''SELECT employeeNumber, lastName, firstName, officeCode, city
                        FROM employees
                        JOIN offices
                        USING (officeCode)
                        WHERE city = "Boston"''').fetchall())
df.columns = [x[0] for x in cur.description]
df

   employeeNumber   lastName firstName  officeCode    city
0            1188   Firrelli     Julie           2  Boston
1            1216  Patterson     Steve           2  Boston

## Are there any offices that have zero employees?
Hint: Combine the employees and offices tables and use a group by.

In [26]:
# Your code here
# Option 1
df = pd.DataFrame(cur.execute('''SELECT officeCode, city 
                        FROM offices O
                        LEFT JOIN employees E
                        USING (officeCode)
                        WHERE E.officeCode IS null''').fetchall())
df.columns = [x[0] for x in cur.description]
print(df)

# Option 2
df = pd.DataFrame(cur.execute('''SELECT count(employeeNumber) as num_of_empl, city, firstName, officeCode
                        FROM offices O
                        LEFT JOIN employees E
                        USING (officeCode)
                        GROUP BY E.officeCode
                        HAVING num_of_empl = 0
                        ''').fetchall())
df.columns = [x[0] for x in cur.description]
df

   officeCode    city
0          27  Boston

   num_of_empl    city firstName  officeCode
0            0  Boston      None          27

## Write 3 Questions of your own and answer them

In [32]:
# Answers will vary
# Question 1: Display the htmlDescription and employee's first and last name for each product that each employee has sold

df = pd.DataFrame(cur.execute('''SELECT employeeNumber, firstName, lastName, orderNumber, productName, productDescription
                        FROM employees 
                        JOIN customers 
                        ON employeeNumber = salesRepEmployeeNumber
                        JOIN orders 
                        USING (customerNumber)
                        JOIN orderdetails
                        USING (orderNumber)
                        JOIN products
                        USING (productCode)
                        ''').fetchall())
df.columns = [x[0] for x in cur.description]
print(df.size)
df.head()

17976

,employeeNumber,firstName,lastName,orderNumber,productName,productDescription
0,1165,Leslie,Jennings,10113,1958 Setra Bus,"Model features 30 windows, skylights & glare r..."
1,1165,Leslie,Jennings,10113,1940 Ford Pickup Truck,"This model features soft rubber tires, working..."
2,1165,Leslie,Jennings,10113,1939 Cadillac Limousine,Features completely detailed interior includin...
3,1165,Leslie,Jennings,10113,1996 Peterbilt 379 Stake Bed with Outrigger,"This model features, opening doors, detailed e..."
4,1165,Leslie,Jennings,10135,1968 Ford Mustang,"Hood, doors and trunk all open to reveal highl..."
...,...,...,...,...,...,...
2991,1702,Martin,Gerard,10184,1954 Greyhound Scenicruiser,"Model features bi-level seating, 50 windows, s..."
2992,1702,Martin,Gerard,10184,1950's Chicago Surface Lines Streetcar,This streetcar is a joy to see. It has 80 sepa...
2993,1702,Martin,Gerard,10184,Diamond T620 Semi-Skirted Tanker,This limited edition model is licensed and per...
2994,1702,Martin,Gerard,10303,1911 Ford Town Car,"Features opening hood, opening doors, opening ..."
2995,1702,Martin,Gerard,10303,1936 Mercedes Benz 500k Roadster,This model features grille-mounted chrome horn...

In [42]:
# Your code here
# Quetion 2: Display the Number of each Products sold?
df = pd.DataFrame(cur.execute('''SELECT productCode, productName, productDescription, SUM(quantityOrdered) as nums_sold                        
                        FROM products P 
                        LEFT JOIN orderdetails OD
                        USING (productCode)
                        GROUP BY productCode
                        ORDER BY nums_sold
                        ''').fetchall())
df.columns = [x[0] for x in cur.description]
print(df.size)
df.head()

440

,productCode,productName,productDescription,nums_sold
0,S18_3233,1985 Toyota Supra,"This model features soft rubber tires, working...",NaN
1,S18_4933,1957 Ford Thunderbird,"This 1:18 scale precision die-cast replica, wi...",767.0
2,S24_1046,1970 Chevy Chevelle SS 454,"This model features rotating wheels, working s...",803.0
3,S24_3969,1936 Mercedes Benz 500k Roadster,This model features grille-mounted chrome horn...,824.0
4,S18_2248,1911 Ford Town Car,"Features opening hood, opening doors, opening ...",832.0

In [ ]:
# Your code here

In [ ]:
# Your code here

## Level Up: Display the names of every individual product that each employee has sold

In [33]:
# Your code here

df = pd.DataFrame(cur.execute('''SELECT employeeNumber, firstName, lastName, orderNumber, productName, productDescription
                        FROM employees 
                        JOIN customers 
                        ON employeeNumber = salesRepEmployeeNumber
                        JOIN orders 
                        USING (customerNumber)
                        JOIN orderdetails
                        USING (orderNumber)
                        JOIN products
                        USING (productCode)
                        ''').fetchall())
df.columns = [x[0] for x in cur.description]
print(df.size)
df.head()

17976

,employeeNumber,firstName,lastName,orderNumber,productName,productDescription
0,1165,Leslie,Jennings,10113,1958 Setra Bus,"Model features 30 windows, skylights & glare r..."
1,1165,Leslie,Jennings,10113,1940 Ford Pickup Truck,"This model features soft rubber tires, working..."
2,1165,Leslie,Jennings,10113,1939 Cadillac Limousine,Features completely detailed interior includin...
3,1165,Leslie,Jennings,10113,1996 Peterbilt 379 Stake Bed with Outrigger,"This model features, opening doors, detailed e..."
4,1165,Leslie,Jennings,10135,1968 Ford Mustang,"Hood, doors and trunk all open to reveal highl..."

## Level Up: Display the Number of Products each employee has sold

In [40]:
# Your code here

df = pd.DataFrame(cur.execute('''SELECT employeeNumber, firstName, lastName, COUNT(employeeNumber) AS num_sold 
                        FROM employees E
                        JOIN customers C
                        ON employeeNumber = salesRepEmployeeNumber
                        JOIN orders O
                        USING (customerNumber)
                        JOIN orderdetails OD
                        USING (orderNumber)
                        JOIN products P
                        USING (productCode)
                        GROUP BY E.employeeNumber''').fetchall())
df.columns = [x[0] for x in cur.description]
print(df.size)
df.head()

60

   employeeNumber firstName   lastName  num_sold
0            1165    Leslie   Jennings       331
1            1166    Leslie   Thompson       114
2            1188     Julie   Firrelli       124
3            1216     Steve  Patterson       152
4            1286  Foon Yue      Tseng       142

## Summary

Congrats! You practiced using join statements and leveraged your foreign keys knowledge!